tutorials/openfoam_tutorials/les/lidDrivenCavity/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  2412
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// Density (kg/m³)
rho             [1 -3 0 0 0 0 0] 1000.0;

// Kinematic viscosity (m²/s) - for Re=1000
nu              [0 2 -1 0 0 0 0] 1e-3;

// ************************************************************************* //